In [1]:
import pandas as pd
import numpy as np
import re

In [2]:
df = pd.read_excel("../data_versions/Online Retail(1).xlsx")

In [3]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [5]:
df.loc[df.Description.isna(),:]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
622,536414,22139,NaN,56,2010-12-01 11:52:00,0.0,NaN,United Kingdom
1970,536545,21134,NaN,1,2010-12-01 14:32:00,0.0,NaN,United Kingdom
1971,536546,22145,NaN,1,2010-12-01 14:33:00,0.0,NaN,United Kingdom
1972,536547,37509,NaN,1,2010-12-01 14:33:00,0.0,NaN,United Kingdom
1987,536549,85226A,NaN,1,2010-12-01 14:34:00,0.0,NaN,United Kingdom
...,...,...,...,...,...,...,...,...
535322,581199,84581,NaN,-2,2011-12-07 18:26:00,0.0,NaN,United Kingdom
535326,581203,23406,NaN,15,2011-12-07 18:31:00,0.0,NaN,United Kingdom
535332,581209,21620,NaN,6,2011-12-07 18:35:00,0.0,NaN,United Kingdom
536981,581234,72817,NaN,27,2011-12-08 10:33:00,0.0,NaN,United Kingdom
538554,581408,85175,NaN,20,2011-12-08 14:06:00,0.0,NaN,United Kingdom

we have null description values which is a problem; we mainly need InvoiceNo and Description. Let's see if we can use StockCode to fill out null descriptions

In [6]:
df.loc[df.StockCode == 22134,:]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
1514,536544,22134,LADLE LOVE HEART RED,1,2010-12-01 14:32:00,0.85,NaN,United Kingdom
2655,536592,22134,LADLE LOVE HEART RED,4,2010-12-01 17:06:00,0.85,NaN,United Kingdom
9824,537219,22134,LADLE LOVE HEART RED,6,2010-12-05 15:47:00,0.42,14081.0,United Kingdom
10433,537237,22134,LADLE LOVE HEART RED,2,2010-12-06 09:58:00,0.85,NaN,United Kingdom
11197,537240,22134,LADLE LOVE HEART RED,1,2010-12-06 10:08:00,0.85,NaN,United Kingdom
...,...,...,...,...,...,...,...,...
529684,580744,22134,MINI LADLE LOVE HEART RED,288,2011-12-06 09:31:00,0.36,13694.0,United Kingdom
532271,580983,22134,MINI LADLE LOVE HEART RED,1,2011-12-06 16:26:00,0.83,NaN,United Kingdom
535551,581217,22134,MINI LADLE LOVE HEART RED,1,2011-12-08 09:20:00,0.83,NaN,United Kingdom
539529,581439,22134,MINI LADLE LOVE HEART RED,1,2011-12-08 16:30:00,0.83,NaN,United Kingdom
540746,581492,22134,MINI LADLE LOVE HEART RED,1,2011-12-09 10:03:00,0.83,NaN,United Kingdom

Since one stock code can have multiple descriptions (for similar products), let's take the most common description for each stock code to fill out missing descriptions

In [7]:
# get stockcodes for rows with missing descriptions
codes = pd.unique(df.loc[df.Description.isna(),:].StockCode)
codes[:5]

array([22139, 21134, 22145, 37509, '85226A'], dtype=object)

In [8]:
# get most common description for each stock code to fill out missing descriptions
code_desc = {}
for code in codes:
    df_temp = df.loc[df.StockCode == code, :]
    counts = df_temp.Description.value_counts()
    # print(code, counts.index[0])
    if counts.shape == (0,): # for cases when NULL is the only description available for a stock code
        continue
    code_desc.update(
        {
            code: counts.index[0]
        }
    )

In [9]:
code_desc[codes[0]]

'RETROSPOT TEA SET CERAMIC 11 PC '

In [10]:
keys = code_desc.keys()
for code in keys:
    df.loc[(df.StockCode == code) & (df.Description.isna()), "Description"] = code_desc[code]

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  541797 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

the rest of the missing descriptions are not associated with stock codes that we can get info from; let's drop them

In [12]:
df2 = df.dropna(subset=["Description"])
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 541797 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541797 non-null  object
 1   StockCode    541797 non-null  object
 2   Description  541797 non-null  object
 3   Quantity     541797 non-null  int64
 4   InvoiceDate  541797 non-null  datetime64[ns]
 5   UnitPrice    541797 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541797 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 37.2+ MB

Now we have as many non-null rows as possible; the next step is to look for any irregularities in InvoiceNo and Description, as those are the 2 main columns we will need for association-rule mining (ARM).

In [13]:
df2.isna().sum()

InvoiceNo           0
StockCode           0
Description         0
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     134968
Country             0
dtype: int64

In [14]:
# remove non-positive Quantity values
df3 = df2.loc[df2.Quantity > 0, :]

In [15]:
# all Description values seem to be uppercase strings, so look for any lowercase
regex = df3.Description.astype(str).str.contains(r'[a-z]')
np.unique(regex)

array([False,  True])

In [16]:
df3[regex]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
482,536408,21705,BAG 500g SWIRLY MARBLES,12,2010-12-01 11:41:00,1.65,14307.0,United Kingdom
918,536500,46000M,POLYESTER FILLER PAD 45x45cm,10,2010-12-01 12:35:00,1.55,17377.0,United Kingdom
1961,536544,21703,BAG 125g SWIRLY MARBLES,1,2010-12-01 14:32:00,0.85,NaN,United Kingdom
1962,536544,21704,BAG 250g SWIRLY MARBLES,1,2010-12-01 14:32:00,1.66,NaN,United Kingdom
2038,536557,46000R,POLYESTER FILLER PAD 45x30cm,2,2010-12-01 14:41:00,1.45,17841.0,United Kingdom
...,...,...,...,...,...,...,...,...
540653,581492,21703,BAG 125g SWIRLY MARBLES,1,2011-12-09 10:03:00,0.83,NaN,United Kingdom
540654,581492,21704,BAG 250g SWIRLY MARBLES,1,2011-12-09 10:03:00,1.63,NaN,United Kingdom
541054,581492,22965,3 TRADITIONAl BISCUIT CUTTERS SET,1,2011-12-09 10:03:00,4.13,NaN,United Kingdom
541612,581514,21705,BAG 500g SWIRLY MARBLES,84,2011-12-09 11:20:00,0.39,17754.0,United Kingdom
541615,581516,21705,BAG 500g SWIRLY MARBLES,24,2011-12-09 11:26:00,0.39,14422.0,United Kingdom

In [17]:
regex = df3.Description.astype(str).str.contains(r'[a-z]{3,}') # additional parameter to exclude measurement units (g, cm, etc.)
np.unique(regex)

array([False,  True])

In [18]:
df3[regex].shape

(638, 8)

If we exclude all strings with more than 3 lowercase letters (1 or 2 are used for measurements) then we would lose ~700 rows.

In [19]:
df3[regex].Description.value_counts()

Description
Manual               328
Next Day Carriage     80
check                 39
found                 25
adjustment            14
                    ...
thrown away            1
found box              1
damaged                1
Found in w/hse         1
check?                 1
Name: count, Length: 64, dtype: int64

Inspecting the suspected outlier values, nearly half of them are just 'Manual'. The source website did not provide any information as to what that might mean, and it isn't a product name. The top 5 suspected outliers account for 486/638 total suspected outliers, which only leaves 152 rows. I think it is quite safe to remove all suspected outliers, since removing ~700 values, more than half of which we know for sure are definite outliers will not in any significant way impact any models.

In [20]:
# remove outliers
df4 = df3[~regex]
df4.info()

<class 'pandas.core.frame.DataFrame'>
Index: 530632 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    530632 non-null  object
 1   StockCode    530632 non-null  object
 2   Description  530632 non-null  object
 3   Quantity     530632 non-null  int64
 4   InvoiceDate  530632 non-null  datetime64[ns]
 5   UnitPrice    530632 non-null  float64
 6   CustomerID   397527 non-null  float64
 7   Country      530632 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 36.4+ MB

Now, we inspect InvoiceNo, which seems to be simply numbers, so let's look for any entries that have non-numerical characters.

In [21]:
# look for outliers in InvoiceNo
regex = df4.InvoiceNo.astype('str').str.contains(r'[^0-9]')
np.unique(regex)

array([False])

It seems like there are no irregularities within the InvoiceNo column.

We are now left with only purchases, we have filled in all missing product descriptions as possible, have removed evident outliers from the 2 most important columns (InvoiceNo, Description); the dataset should now be ready for ARM.